Tekla Open API Reference for Tekla Structures 2025
Polymesh Methods
The Polymesh type exposes the following members.
Methods
Name | Description
CompareFingerprints
 Compares two fingerprints
Convert
 Converts a struct of polymeshes to a list of
FacetedBrep
.
ConvertInvalidInfoFromStruct
 Convert a struct of invalid info to a list of pairs of outer loop index and error code. Read indexes and error codes from the integer list.
ConvertToStruct
 Converts a
FacetedBrep
 to struct dot polymesh.
Fingerprint
 Gets fingerprint information for input brep
FromStruct
 Converts a struct of polymesh to a
FacetedBrep
.
GetSolidBrep
 Gets the cleaned Brep
ToStruct
 Converts a
FacetedBrep
 to dotnet polymesh struct.
Validate
 Converts a
FacetedBrep
 to a polymesh and validates.
Top
See Also
Reference
Polymesh Class
Tekla.Structures.Model Namespace